//パーツ
interface IFCompParts {
  P: string;
}
const comp_parts: Array<IFCompParts> = [
  { "P": "アクト" },
  { "P": "アジア" },
  { "P": "アット" },
  { "P": "アドバイザー" },
  { "P": "アラーム" },
  { "P": "イン" },
  { "P": "インター" },
  { "P": "インテリジェンス" },
  { "P": "ウェイ" },
  { "P": "エア" },
  { "P": "エイ" },
  { "P": "エイジ" },
  { "P": "エン" },
  { "P": "エンター" },
  { "P": "オール" },
  { "P": "オレンジ" },
  { "P": "キャリア" },
  { "P": "クック" },
  { "P": "グルメ" },
  { "P": "グローバル" },
  { "P": "ゲイン" },
  { "P": "コム" },
  { "P": "コロ" },
  { "P": "コンサルティング" },
  { "P": "サービス" },
  { "P": "サイト" },
  { "P": "シード" },
  { "P": "シェア" },
  { "P": "システム" },
  { "P": "ジャスト" },
  { "P": "ジャパン" },
  { "P": "スター" },
  { "P": "スタイル" },
  { "P": "ソフト" },
  { "P": "ダイヤ" },
  { "P": "チーム" },
  { "P": "ディスコ" },
  { "P": "ディップ" },
  { "P": "ディファクト" },
  { "P": "デジタル" },
  { "P": "ドゥ" },
  { "P": "トーキョー" },
  { "P": "トリ" },
  { "P": "トレンド" },
  { "P": "ナビ" },
  { "P": "ニールセン" },
  { "P": "ネイチャー" },
  { "P": "ネオ" },
  { "P": "ネット" },
  { "P": "パートナー" },
  { "P": "ハウス" },
  { "P": "パッド" },
  { "P": "パテント" },
  { "P": "パナ" },
  { "P": "ピア" },
  { "P": "ビジョン" },
  { "P": "ビズ" },
  { "P": "ビッグ" },
  { "P": "フィールド" },
  { "P": "プラ" },
  { "P": "プライス" },
  { "P": "ブランド" },
  { "P": "プランニング" },
  { "P": "ブリッジ" },
  { "P": "ブレイン" },
  { "P": "ブレーン" },
  { "P": "プレス" },
  { "P": "ページ" },
  { "P": "ボイス" },
  { "P": "ポート" },
  { "P": "ホーム" },
  { "P": "ホット" },
  { "P": "マーケティング" },
  { "P": "マイ" },
  { "P": "マイクロ" },
  { "P": "マクロ" },
  { "P": "メゾン" },
  { "P": "メディア" },
  { "P": "モンド" },
  { "P": "ライフ" },
  { "P": "ラボ" },
  { "P": "リーチ" },
  { "P": "リクルーティング" },
  { "P": "リサーチ" },
  { "P": "リスク" },
  { "P": "リビング" },
  { "P": "リンク" },
  { "P": "ルート" },
  { "P": "ワーク" },
  { "P": "ワークス" },
  { "P": "ワイヤー" },
]
const parts_size: number = comp_parts.length;

//END
interface IFCompEnd {
  P: string;
}
const comp_end: Array<IFCompEnd> = [
  { "P": "銀行" },
  { "P": "工業" },
  { "P": "興行" },
  { "P": "バンク" },
  { "P": "実業" },
  { "P": "貿易" },
  { "P": "商店" },
  { "P": "企画" },
  { "P": "商事" },
  { "P": "不動産" },
  { "P": "製作所" },
  { "P": "研究所" },
  //{ "P": "ホールディングス" },
  { "P": "製薬" },
  { "P": "物流" },
  { "P": "運輸" },
  { "P": "設計" },
  { "P": "事務所" },
  { "P": "建築" },
  { "P": "商会" },
  { "P": "通商" },
  { "P": "林業" },
  { "P": "開発" },
]
const end_size: number = comp_end.length;

//NAME
export interface IFCompany {
  K: string;
}

export const getCompany = (): IFCompany => {
  const parts1_idx = Math.floor(Math.random() * parts_size);
  const parts2_idx = Math.floor(Math.random() * parts_size);
  const end_idx = Math.floor(Math.random() * end_size);

  const [FRONT, BACK] = !!(Math.random() > 0.5) ? ["株式会社", ""] : ["", "株式会社"];

  const name = FRONT
    + comp_parts[parts1_idx]["P"]
    + comp_parts[parts2_idx]["P"]
    + comp_end[end_idx]["P"]
    + BACK;
  return { K: name }
}